{
    "about": {
        "about-name": "Gio Majadas",
        "about-email": "giomjds@gmail.com",
        "about-address": "Manila, Philippines",
        "about-phone": "+63 920 212 9617",
        "about-age": "21 years old",
        "about-exp": "2nd Year BSIT-SD Student @ Laguna University",
        "biography1": "Hello! I'm Gio Majadas, an IT student particularly interested in making innovations and pontifications about technology. I am currently finishing my degree in Bachelor of Science in Information Technology at Laguna University.",
        "biography2": "I have a strong background in database administration, UI/UX design, and frontend development. My interest in how things work inside technology started with what applications and web infrastructure are really made of. With time, I managed to build upon these skills, learning HTML, CSS, JavaScript, and PHP, among others in programming languages, inclusive of Python, C, C++, C#, VB.NET, and SQL.",
        "biography3": "Along with my technical experience, I am also innately inquisitive and able to solve problems—a lifelong learner. I always yearn for improvement in all I do, whether it's creating an aesthetically appealing application online, network protection, or radical problem debugging.",
        "biography4": "As rarely as I am not immersed with code when not working, you would catch me studying at will or from time to time indulging in online games, having entirely geared my effort toward IT sector development.",
        "skills": [
            {"name": "HTML", "percentage": 87},
            {"name": "CSS", "percentage": 79},
            {"name": "JavaScript", "percentage": 66},
            {"name": "SQL", "percentage": 61},
            {"name": "PHP", "percentage": 70},
            {"name": "C", "percentage": 78},
            {"name": "C++", "percentage": 93},
            {"name": "C#", "percentage": 67},
            {"name": "Visual Basic .NET", "percentage": 74},
            {"name": "GitHub", "percentage": 76}
        ],
        "education": [
            {"name_and_year": "Elementary ( 2010 - 2015 )", "school": "Dayap Elementary School - Annex", "description": "Elementary school life was a vivid combination of curiosity and adventure: every day, something new was learned. One learned starting from elementary physics and arithmetic principles to the first letter combinations in writing. Even in shared crayons and recess activities, friendships were initiated inside the four walls of a class. This is what I did those years through: focused on creating in myself a sense of wonder for everything that was unfolding around me and on mastering the basic abilities that would help me become successful."},
            {"name_and_year": "Junior High School ( 2015 - 2019 )", "school": "Dayap National High School - Main", "description": "A greater amount of independence and self-discovery began with the move to junior high school. Innumerable amounts of time were used up by the opportunity to study a lot of new topics in depth, whether this was exploring technology on the one hand or delving into literature and history on the other. Another aspect was that social dynamics changed with the newly gained friendship and involvement in extracurricular activities. For the past, I have been forming my self-identity, learning about my interests and developed strengths, and setting a base for my future goals."},
            {"name_and_year": "Senior High School ( 2019 - 2021 )", "school": "Luzonian School of Excellence in Science and Technology", "description": "Senior high school certainly turned out to be a real defining period. The emphasis on the development of intellect and the self grew. I began attending more advanced classes and technology groups while taking my future as an IT seriously. The pressure of doing well in studies was balanced with the exhilaration of discovering new opportunities that put me into the professional world, such as internships and projects. These, coupled with the enhancement of my technical skills, have been endowed with an umpteen number of lessons in tenacity, teamwork, and time management."},
            {"name_and_year": "College ( 2023 - Current )", "school": "Laguna University", "description": "The most memorable phase in my life is my undergraduate years, when centre stage was taken by information technology. They enrolled me in courses on programming, database administration, network security, and cloud computing to make me an expert in domains such as mine. Students gain necessary practical experience through internships, group projects, and hands-on laboratories within the teaching of how to tackle technical problems. Their involvement in tech clubs and participation in coding competitions helped in the enhancement of their technical skills, group work, communication, and degree of technological awareness. The aim at college was not to learn only the technical skills but to become a full, all-rounded IT professional equipped to handle all kinds of problems and challenges in the fast-moving industry."}
        ],
        "experience": [
            {"year": "( 2023 - Current )", "work": "Teaching Coding / Programming Basics", "description": "In this position, I planned individual lessons and provided breakdowns of tricky subjects while adjusting teaching methods according to different learning styles as a tutor for the basics of information technology with a focus on coding and programming. This work has improved my ability to explain technical concepts as simply and concisely as possible and is now being used in IT environments when explaining technical information to clients, colleagues, and end-users. Additionally, tutoring has provided a foundation for augmenting my patience and empathy, and the two now exist simultaneously when working to assist others with technology issues."},
            {"year": "( 2021 - 2022 )", "work": "Leadership Roles", "description": "I have been able to undertake and execute such activities and projects in my leadership role in a tech club. This improved my ability to delegate tasks and make sure they were done on time and through effective planning. Furthermore, I now have experience with leading and motivating a group of colleagues in a way that stimulates creativity and teamwork. Project management and team leadership are inbuilt parts of the delivery of successful technology solutions in the IT industry, for which these skills become quite essential."},
            {"year": "( 2021 - 2022 )", "work": "Customer Service", "description": "In order to obtain an added skill in terms of tuning my communication and problem-solving skills when working as a customer service representative, I was very comprehensively equipped with how to handle people with different levels of technical expertise. My role was to help the clients in solving problems every day, that would in many ways involve diagnosing software and making technical answers as clear as possible. My job has enabled me to learn two major traits: patience and adaptability, both vital in handling IT technical challenges."}
        ]
    },
    "services": [
        {"name": "Front-End Development", "description": "Building responsive, interactive websites using HTML, CSS, and JavaScript, and popular frameworks like React or Angular."},
        {"name": "UI/UX Designer", "description": "Crafting intuitive and visually stunning interfaces that simplify complex interactions and elevate brand identities."},
        {"name": "Git & GitHub", "description": "Streamlining development workflows and ensuring seamless collaboration through expert Git and GitHub management."},
        {"name": "Database Management", "description": "Designing, implementing, and optimizing high-performance databases that ensure data integrity, security, and scalability."},
        {"name": "Digital Marketing", "description": "Developing and executing targeted digital marketing strategies that drive brand awareness, engagement, and conversions."},
        {"name": "Server-side Development", "description": "Designing and implementing robust, scalable, and secure server-side architectures that power fast and reliable web applications."}
    ],
    "contact": {
        "phone": "+63 920 212 9617",
        "email": "giomjds@gmail.com",
        "address": "Manila, Philippines"
    }
}